// Автор: Новиков Г.В.
// Группа: 1302
// Дата начала: 16.09.2021
// Дата окончания: 
// Версия: 1.1.01
// 58/27
// Формулировка: 
// 1. P(x) = 99,09 * x^8 + 9,099 * x^5 – 9,909 * x
// 2. P(x) = 24,35 * x^7 + 83,174 * x^5 – 24,26 * x^3

#include <iostream>
#include <iomanip>

using namespace std;

int main() {

	cout << "Автор: Новиков Г.В.\n"
	"Группа: 1302\n"
	"Дата начала: 16.09.2021 \n"
	"Дата окончания: 17.01.2021\n"
	"Версия: 1.1.01\n"
	"Введите x(кроме 0): ";
	double x;
	cin >> x;

	cout << setprecision(10);
	// 58
	cout << endl << "P(x) = 99,09 * x^8 + 9,099 * x^5 – 9,909 * x" << endl;				// x * (x**4 * (99.09 * x**3 + 9.099) - 9.909)
	double x2 = x * x;
	double x3 = x2 * x;
	double x4 = x3 * x;
	double res58 = x * (x4 * (99.09 * x3 + 9.099) - 9.909);
	cout << "P58 = x * (x**4 * (99.09 * x**3 + 9.099) - 9.909) = " << res58 << endl << endl;

	// 27
	cout << "P(x) = 24,35 * x^7 + 83,174 * x^5 – 24,26 * x^3" << endl;				// x**3 * (x**2 * (24.35 * x**2 + 83.174) - 24.26)
	double res27 = x3 * (x2 * (24.35 * x2 + 83.174) - 24.26);
	cout << "P27 = " << res27 << endl << endl;

	cout << "Result: P58/P27 = " << res58 / res27 << endl;

	return 0;
}
